stresstest/demo/demo.yml
config:
  target: 'https://staging.workbenchdata.com'
  http:
    timeout: 60
    maxSockets: 3
  environments:
    staging:
      target: 'https://staging.workbenchdata.com'
    dev:
      target: 'http://localhost:8000'
  phases:
    - duration: 10
      arrivalRate: 3
  processor: './helpers.js'
scenarios:
  - name: 'User loads demo workflow'
    flow:
    - get:
        url: '/workflows/{{ DemoWorkflowId }}/'
        afterResponse: 'loadVarsFromWorkflowHtml'
    #- log: 'Workflow {{ WorkflowId }}: loading...'
    - get:
        url: '/api/wfmodules/{{ ColumnChartId }}/output'
    - get:
        url: '/api/wfmodules/{{ ColumnChartId }}/embeddata'
    - get:
        url: '/api/wfmodules/{{ ColumnChartId }}/render?endrow=200'
    #- log: 'Workflow {{ WorkflowId }}: changing sort column...'
    - post:
        url: '/api/workflows/{{ WorkflowId }}'
        json: { 'selected_wf_module': 5 }
    - get:
        url: '/api/wfmodules/{{ SortFromTableId }}/render?endrow=200'
    - patch:
        url: '/api/parameters/{{ SortColumnParamId }}'
        json: { 'value': 'MetroArea' }
    - get:
        url: '/api/wfmodules/{{ SortFromTableId }}/render?endrow=200'
    #- log: 'Workflow {{ WorkflowId }}: Reloading chart...'
    - post:
        url: '/api/workflows/{{ WorkflowId }}'
        json: { 'selected_wf_module': 7 }
    - get:
        url: '/api/wfmodules/{{ ColumnChartId }}/output'
    - get:
        url: '/api/wfmodules/{{ ColumnChartId }}/embeddata'
    - get:
        url: '/api/wfmodules/{{ ColumnChartId }}/render?endrow=200'